package com.example.expendgridview

/**
 *
 *  _                 _    _
 * | |               | |  (_)
 * | |__   __ _ _ __ | | ___ _ __   __ _
 * | '_ \ / _` | '_ \| |/ / | '_ \ / _` |
 * | | | | (_| | | | |   | | | | | (_| |
 * |_| |_|\__,_|_| |_|_|\_\_|_| |_|\__, |
 ********************************** __/ |
 ********************************* |___/
 * create time 2021/12/17 2:47 下午
 * create by 胡汉君
 * 实现这个接口来添加expendControl view,接口中有两个方法调用，一个是expend，一个是fold，对应折叠和展开
 *
 */
interface IExpendControl {
    /**
     * 展开
     */
    fun expend()

    /**
     * 折叠
     */
    fun fold()
}